{"characterName":"Rogue","characterRace":"Elf","characterClass":"Rogue","description":"","stat_armorClass":14,"stat_strength":15,"stat_dexterity":16,"stat_constitution":10,"stat_intelligence":14,"stat_wisdom":12,"stat_charisma":8,"stat_strengthMod":2,"stat_dexterityMod":3,"stat_constitutionMod":0,"stat_intelligenceMod":2,"stat_wisdomMod":1,"stat_charismaMod":-1,"stat_healthMax":8,"currentHealth":8,"stat_speed":30,"abilitiesList":[{"name":"Background","highlightDescription":"","description":"Neutral Good, Age: 60 <br>  This albino high sun elf looks down on non-elfs with an air of snobiness and superiority. He recently left his family’s cloister in the Hidden elf city of Farbinger for the first time in his life, beginning his quest to reach elvin adulthood by discovering powerful secrets and bringing them back to his tribe. Although obviously superior to the other races he has encountered, he tends to take pity on those who are weak, treating them like one would treat a pet. Some of these antics include involuntary redistribution of gold. "},{"name":"Equipment","highlightDescription":"","description":"-a rapier <br> -a shortbow and quiver of 20 arrows <br> -a burglar’s pack (Includes a backpack, a bag of 1,000 ball bearings, 10 feet of string, a bell, 5 candles, a crowbar, a hammer, 10 pitons, a hooded lantern, 2 flasks of oil, 5 days rations, a tinderbox, and a waterskin. The pack also has 50 feet of hempen rope strapped to the side of it)<br> -leather armor, two daggers, and thieves’ tools "},{"name":"Rapier","highlightDescription":"","description":"Dexterity + 2 to hit <br> Damage: 1 D8 + Dexterity "},{"name":"Shortbow","highlightDescription":"","description":"Range: 80/320 <br> Dexterity + 2 to hit <br> 1D6 + Dexterity damage "},{"name":"Sneak Attack","highlightDescription":"","description":"You know how to strike subtly and exploit a foe’s distraction. Once per turn, you can deal an extra 1d6 damage to one creature you hit with an attack if you have advantage on the attack roll. The attack must use a finesse or a ranged weapon. You don’t need advantage on the attack roll if another enemy of the target is within 5 feet of it, that enemy isn’t incapacitated, and you don’t have disadvantage on the attack roll. "},{"name":"Frostbite","highlightDescription":"","description":"Spellcasting Ability: 12 <br> Casting Time: 1 action, Range: 60ft, Duration: Instantaneous A creature you can see must pass a Constitution save or take 1d6 cold damage and have disadvantage on the next weapon attack roll it makes before the end of its next turn. "},{"name":"Keen Senses","highlightDescription":"","description":"You have proficiency in the Perception skill. (+2 to Perception rolls) "},{"name":"Fey Ancestry","highlightDescription":"","description":"You have advantage on saving throws against being charmed, and magic can’t put you to sleep. "},{"name":"Darkvision","highlightDescription":"","description":"Accustomed to life underground, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray. "},{"name":"Trance","highlightDescription":"","description":"Elves don’t need to sleep. Instead, they meditate deeply, remaining semiconscious, for 4 hours a day. (The Common word for such meditation is “trance.”) While meditating, you can dream after a fashion; such dreams are actually mental exercises that have become reflexive through years of practice. After resting in this way, you gain the same benefit that a human does from 8 hours of sleep. "},{"name":"Languages","highlightDescription":"","description":"You can speak, read, and write Common and Elvish. Elvish is fluid, with subtle intonations and intricate grammar. Elven literature is rich and varied, and their songs and poems are famous among other races. Many bards learn their language so they can add Elvish ballads to their repertoires. "},{"name":"Thieves Cant","highlightDescription":"","description":"During your rogue training you learned thieves’ cant, a secret mix of dialect, jargon, and code that allows you to hide messages in seemingly normal conversation. Only another creature that knows thieves’ cant understands such messages. It takes four times longer to convey such a message than it does to speak the same idea plainly. In addition, you understand a set of secret signs and symbols used to convey short, simple messages, such as whether an area is dangerous or the territory of a thieves’ guild, whether loot is nearby, or whether the people in an area are easy marks or will provide a safe house for thieves on the run. "}]}