{"characterName":"Cleric","characterRace":"Goblin","characterClass":"Cleric","description":"","stat_armorClass":16,"stat_strength":8,"stat_dexterity":16,"stat_constitution":14,"stat_intelligence":12,"stat_wisdom":15,"stat_charisma":10,"stat_strengthMod":-1,"stat_dexterityMod":3,"stat_constitutionMod":2,"stat_intelligenceMod":1,"stat_wisdomMod":2,"stat_charismaMod":0,"stat_healthMax":8,"currentHealth":8,"stat_speed":30,"abilitiesList":[{"name":"Backstory","highlightDescription":"Chaotic Nuetral, Age 55, Spellcasting Wisdom","description":"Worships Athena, the goddess of wisdom and civilization (whose symbol is an owl).   As a young cleric, this goblin traveled from war to war, healing those he could. Over the years, however, he has become jaded to the folly of war, and with blessings from his God Athena hopes to end all war so that society can prosper.  Uncannily wise for a goblin, he deals with discrimination by attempting to shame, pulling out stories and knowledge from his experience as a war healer. "},{"name":"Equipment","highlightDescription":"","description":"a mace, leather armor, a priest's pack (Includes a backpack, a blanket, 10 candles, a tinderbox, an alms box, 2 blocks of incense, a censer, vestments, 2 days of rations, and a waterskin), a shield, a holy symbol"},{"name":"Mace","highlightDescription":"Strength + 2 to hit","description":"1D6 + Strength blugeoning damage"},{"name":"Cure Wounds","highlightDescription":"","description":"1st Level Evocation <br> CASTING TIME: 1 Action <br> RANGE/AREA: Touch <br> DURATION: Instantaneous <br> A creature you touch regains a number of hit points equal to 1d8 + your spellcasting ability modifier (WIS). This spell has no effect on undead or constructs."},{"name":"Bless","highlightDescription":"","description":"1st LEVEL <br> CASTING TIME: 1 Action <br> RANGE/AREA: 30 ft <br> DURATION: Concentration 1 Minute <br> You bless up to three creatures of your choice within range. Whenever a target makes an attack roll or a saving throw before the spell ends, the target can roll a d4 and add the number rolled to the attack roll or saving throw. "},{"name":"Diciple of Life","highlightDescription":"","description":"Whenever you use a spell of 1st level or higher to restore hit points to a creature, the creature regains additional hit points equal to 2 + the spell’s level. "},{"name":"Sacred Flame","highlightDescription":"(Dexterity Save)","description":"Evocation cantrip <br> Casting Time: 1 action <br> Range: 60 feet <br> Duration: Instantaneous <br> Flame-like radiance descends on a creature that you can see within range. The target must succeed on a Dexterity saving throw or take 1d8 radiant damage. The target gains no benefit from cover for this saving throw.  "},{"name":"Guidance","highlightDescription":"","description":"Divination cantrip <br> Casting Time: 1 action <br> Range: Touch <br> Duration: Concentration, up to 1 minute <br> You touch one willing creature. Once before the spell ends, the target can roll a d4 and add the number rolled to one ability check of its choice. It can roll the die before or after making the ability check. The spell then ends. "},{"name":"Spare the Dying","highlightDescription":"","description":"Necromancy cantrip <br> Casting Time: 1 action <br> Range: Touch <br> Duration: Instantaneous <br> You touch a living creature that has 0 hit points. The creature becomes stable. This spell has no effect on undead or constructs. "},{"name":"Shield of Faith","highlightDescription":"","description":"1st-level abjuration <br> Casting Time: 1 bonus action <br> Range: 60 feet <br> Duration: Concentration, up to 10 minutes <br> A shimmering field appears and surrounds a creature of your choice within range, granting it a +2 bonus to AC for the duration. "},{"name":"Inflict Wounds","highlightDescription":"","description":"1st-level necromancy <br> Casting Time: 1 action <br> Range: Touch <br> Duration: Instantaneous <br> Make a melee spell attack against a creature you can reach. On a hit, the target takes 3d10 necrotic damage. "},{"name":"Create/Destroy Water","highlightDescription":"","description":"1st-level transmutation <br> Casting Time: 1 action <br> Range: 30 feet <br> Duration: Instantaneous <br> You either create or destroy water. <br> Create Water. You create up to 10 gallons of clean water within range in an open container. Alternatively, the water falls as rain in a 30-foot cube within range, extinguishing exposed flames in the area. <br> Destroy Water. You destroy up to 10 gallons of water in an open container within range. Alternatively, you destroy fog in a 30-foot cube within range. "},{"name":"Fury of the Small","highlightDescription":"","description":"When you damage a creature with an attack or a spell and the creature's size is larger than yours, you can cause the attack or spell to deal extra damage to the creature. The extra damage equals your level. Once you use this trait, you can't use it again until you finish a short or long rest. "},{"name":"Nimble Escape","highlightDescription":"","description":"The goblin can take the Disengage or Hide action as a bonus action on each of its turns. "},{"name":"Darkvision","highlightDescription":"","description":"Accustomed to life underground, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray. "}]}