{"characterName":"Paladin","characterRace":"Dwarf","characterClass":"Paladin","description":"","stat_armorClass":18,"stat_strength":15,"stat_dexterity":10,"stat_constitution":17,"stat_intelligence":8,"stat_wisdom":13,"stat_charisma":13,"stat_strengthMod":2,"stat_dexterityMod":0,"stat_constitutionMod":3,"stat_intelligenceMod":-1,"stat_wisdomMod":1,"stat_charismaMod":1,"stat_healthMax":8,"currentHealth":8,"stat_speed":25,"abilitiesList":[{"name":"Backstory","highlightDescription":"","description":"Lawful Good, Age 34 <br> Worships Kratos, the winged god of strength, power, and might. This dwarf serves his god with zeal, smashing those hostile to his cause and diving into danger with a laugh. Sometimes his foolhardiness can cause trouble, like when he smashed a thief's head into a support pillar and brought his family’s house down. His comment that “well, if it’d been good stonework, it woulda stayed up” caused his father to send him on a quest to defeat the world’s devils, and to not return until he’d succeeded. "},{"name":"Equipment","highlightDescription":"","description":"Warhammer and Shield <br> Five javelins <br> Chain mail and a holy symbol <br> NOTE: Because of Chain Mail armor, this character has Disadvantage on Stealth checks. "},{"name":"Warhammer","highlightDescription":"Strength + 2 to hit  ","description":"1 D8 + Strength Damage "},{"name":"Javelin","highlightDescription":"","description":"Range: 30/120 <br> Strength + 2 to hit <br> 1D6 + Strength Damage "},{"name":"Lay on Hands","highlightDescription":"","description":"Your blessed touch can heal wounds. You have a pool of healing power that replenishes when you take a long rest. With that pool, you can restore a total number of hit points equal to your paladin level × 5. <br> As an action, you can touch a creature and draw power from the pool to restore a number of hit points to that creature, up to the maximum amount remaining in your pool. <br> Alternatively, you can expend 5 hit points from your pool of healing to cure the target of one disease or neutralize one poison affecting it. You can cure multiple diseases and neutralize multiple poisons with a single use of Lay on Hands, expending hit points separately for each one. This feature has no effect on undead and constructs. "},{"name":"Divine Sense","highlightDescription":"","description":"The presence of strong evil registers on your senses like a noxious odor, and powerful good rings like heavenly music in your ears. As an action, you can open your awareness to detect such forces. Until the end of your next turn, you know the location of any celestial, fiend, or undead within 60 feet of you that is not behind total cover. You know the type (celestial, fiend, or undead) of any being whose presence you sense, but not its identity (the vampire Count Strahd von Zarovich, for instance). Within the same radius, you also detect the presence of any place or object that has been consecrated or desecrated, as with the hallow spell. You can use this feature a number of times equal to 1 + your Charisma modifier. When you finish a long rest, you regain all expended uses. "},{"name":"Dwarven Resilience","highlightDescription":"","description":"You have advantage on Saving Throws against poison, and you have Resistance against poison damage. "},{"name":"Stonecunning","highlightDescription":"","description":"Whenever you make an Intelligence (History) check related to the Origin of stonework, you are considered proficient in the History skill and add double your proficiency bonus to the check, instead of your normal proficiency bonus."},{"name":"Darkvision","highlightDescription":"","description":"Accustomed to life underground, you have superior vision in dark and dim Conditions. You can see in dim light within 60 feet of you as if it were bright light, and in Darkness as if it were dim light. You can’t discern color in Darkness, only shades of gray. "},{"name":"Languages","highlightDescription":"","description":"You can speak, read, and write Common and Dwarvish. Dwarvish is full of hard consonants and guttural sounds, and those characteristics spill over into whatever other language a dwarf might speak. "},{"name":"Dwarven Toughness","highlightDescription":"","description":"Your hit point maximum increases by 1, and it increases by 1 every time you gain a level. "}]}