{"characterName":"Ranger","characterRace":"Human","characterClass":"Ranger","description":"","stat_armorClass":15,"stat_strength":15,"stat_dexterity":16,"stat_constitution":14,"stat_intelligence":13,"stat_wisdom":11,"stat_charisma":9,"stat_strengthMod":2,"stat_dexterityMod":3,"stat_constitutionMod":2,"stat_intelligenceMod":1,"stat_wisdomMod":0,"stat_charismaMod":-1,"stat_healthMax":8,"currentHealth":8,"stat_speed":30,"abilitiesList":[{"name":"Backstory","highlightDescription":"","description":"True Neutral, Age: 28 <br> At the age of 14 this ranger ran away from home. He used the skills he’d learned from his father to hunt and live in the wild, returning a year later towing an elk carcass. After one meal with his parents, he took off into the night, never to return. Instead, he started selling his extra game to nearby villages, living off what he hunted but acquiring better equipment and the occasional luxury supplies. What started as survival became passion, and over time he began to hunt bigger and bigger game, striving to kill the most impressive creatures he could find. "},{"name":"Equipment","highlightDescription":"","description":"leather armor <br> carbon helmet <br> two shortswords  <br> a dungeoneer’s pack (Includes a backpack, a crowbar, a hammer, 10 pitons, 10 torches, a tinderbox, 10 days of rations, and a waterskin. The pack also has 50 feet of hempen rope strapped to the side of it.) <br> Longbow with 20 arrows "},{"name":"Longbow","highlightDescription":"","description":"Range: 150/600 ft <br> Dexterity + 2 to hit <br> 1 D8 + Dexterity damage "},{"name":"Dual Shortswords","highlightDescription":"","description":"Strength + 2 to hit <br> 1D6 + Strength Damage <br>  If dual wielding shortswords, you can use a bonus action to attack with the second sword. That attack doesn’t add Strength to damage (aka only does 1 D6). "},{"name":"Favored Terrain","highlightDescription":"","description":"Forest is Favored Terrain <br> When you make an Intelligence or Wisdom check related to your favored terrain, your proficiency bonus is doubled if you are using a skill that you’re proficient in. While traveling for an hour or more in your favored terrain, you gain the following benefits: <br> Difficult terrain doesn’t slow your group’s travel. <br> Your group can’t become lost except by magical means. <br> Even when you are engaged in another activity while traveling (such as foraging, navigating, or tracking), you remain alert to danger. <br> If you are traveling alone, you can move stealthily at a normal pace. <br> When you forage, you find twice as much food as you normally would. <br> While tracking other creatures, you also learn their exact number, their sizes, and how long ago they passed through the area. "},{"name":"Favored Enemy","highlightDescription":"","description":"Favored Enemy: Constructs <br> You have advantage on Wisdom (Survival) checks to track your favored enemies (Constructs), as well as on Intelligence checks to recall information about them. Constructs are made, not born. Some are programmed by their creators to follow a simple set of instructions, while others are imbued with sentience and capable of independent thought. Golems are the iconic constructs. Many creatures native to the outer plane of Mechanus, such as modrons, are constructs shaped from the raw material of the plane by the will of more powerful creatures. "}]}