{"characterName":"Warlock","characterRace":"Teifling","characterClass":"Warlock","description":"","stat_armorClass":12,"stat_strength":10,"stat_dexterity":13,"stat_constitution":14,"stat_intelligence":13,"stat_wisdom":8,"stat_charisma":17,"stat_strengthMod":0,"stat_dexterityMod":1,"stat_constitutionMod":2,"stat_intelligenceMod":1,"stat_wisdomMod":-1,"stat_charismaMod":3,"stat_healthMax":8,"currentHealth":8,"stat_speed":30,"abilitiesList":[{"name":"Backstory","highlightDescription":"Chaotic Good, Age 24, Spellcasting Charisma","description":"Raised by a Night Hag who took pity on a baby abandoned in the street, this Tiefling has been raised to deceive and magically dismember any in her way. She despises nobles, highborns and aristocracy, seeing them as overindulgent and entitled, especially compared to her upbringing moving between rough hovels. At the age of 20, this Tiefling made a pact with Senetra, the Winged Serpent, against her Night Hag guardian’s wishes. With her new powers she fled in search of ways to bloody those who propagate racism.  "},{"name":"Equipment","highlightDescription":"","description":"2 Javelins <br> a scholar’s pack ( Includes a backpack, a book of lore, a bottle of ink, an ink pen, 10 sheets of parchment, a little bag of sand, and a small knife)<br> Leather armor "},{"name":"Javelin","highlightDescription":"","description":"Range: 30/120 <br> Strength + 2 to hit <br> 1D6 + Strength Damage  "},{"name":"Eldrich Blast","highlightDescription":"+5 to hit","description":"Make a ranged spell attack. On hit, the target takes 1d10 force damage."},{"name":"Thaumatergy","highlightDescription":"","description":"cantrip transmutation, Casting Time: 1 action <br> Range: 30 feet <br> Duration: Up to 1 minute <br> You manifest a minor wonder, a sign of supernatural power, within range. You create one of the following magical effects within range: Your voice booms up to three times as loud as normal for 1 minute. You cause flames to flicker, brighten, dim, or change color for 1 minute. You cause harmless tremors in the ground for 1 minute. You create an instantaneous sound that originates from a point of your choice within range, such as a rumble of thunder, the cry of a raven, or ominous whispers. You instantaneously cause an unlocked door or window to fly open or slam shut. You alter the appearance of your eyes for 1 minute. If you cast this spell multiple times, you can have up to three of its 1-minute effects active at a time, and you can dismiss such an effect as an action. "},{"name":"Minor Illusion","highlightDescription":"","description":"Casting Time: 1 action, Range: 30ft, Duration: 1 minute <br> You create a sound or an image of an object within range that lasts for the duration. The illusion also ends if you dismiss it as an action or cast this spell again. If you create a sound, it can be any volume and noise. The sound can continue unabated for the duration, or you can make sounds at different times. If you create an image of an object it must be no larger than a 5-foot cube. The image can't create any sensory effects. Physical interaction with the image reveals it to be an illusion. A creature can use its action to make an Intelligence check on the illusion. If it discerns the illusion for what it is, the illusion becomes faint to it. "},{"name":"Charm Person","highlightDescription":"","description":"Casting Time: 1 action, Range: 30ft, Duration: 1 hour <br> A humanoid you can see must succeed on a Wisdom saving throw, with advantage if you are currently fighting it, or it becomes charmed by you until the spell ends or someone in your party harms it. It will know it has been charmed when the spell ends. "},{"name":"Arms of Hadar","highlightDescription":"","description":"Casting Time: 1 action, Range: 10ft radius on self <br> Tendrils batter all creatures within 10 feet of you. They must make a Strength save. On a fail, a target takes 2d6 necroticdamage and can't take reactions until its next turn. On a success, it takes half damage and suffers no other effects. "},{"name":"Dark One's Blessing","highlightDescription":"","description":"Starting at 1st level, when you reduce a hostile creature to 0 hit points, you gain temporary hit points equal to your Charisma modifier + your warlock level (minimum o f 1). "},{"name":"Hellish Resistance","highlightDescription":"","description":"You take half damage from fire damage, rounded down (minimum of 1). AKA Fire Resistance "},{"name":"Darkvision","highlightDescription":"","description":"Accustomed to life underground, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray. "}]}